grevaillot/svd_tools/headers/STM32G471xx/rcc.h
#pragma once 

/* --- RCC: Reset and clock control --------------------------------- */

/** @defgroup rcc_registers Reset and clock control Register
@{*/

/** RCC_CR Clock control register **/
#define RCC_CR			MMIO32(RCC_BASE + 0x00)
/** RCC_ICSCR Internal clock sources calibration register **/
#define RCC_ICSCR			MMIO32(RCC_BASE + 0x04)
/** RCC_CFGR Clock configuration register **/
#define RCC_CFGR			MMIO32(RCC_BASE + 0x08)
/** RCC_PLLSYSCFGR PLL configuration register **/
#define RCC_PLLSYSCFGR			MMIO32(RCC_BASE + 0x0c)
/** RCC_CIER Clock interrupt enable register **/
#define RCC_CIER			MMIO32(RCC_BASE + 0x18)
/** RCC_CIFR Clock interrupt flag register **/
#define RCC_CIFR			MMIO32(RCC_BASE + 0x1c)
/** RCC_CICR Clock interrupt clear register **/
#define RCC_CICR			MMIO32(RCC_BASE + 0x20)
/** RCC_AHB1RSTR AHB1 peripheral reset register **/
#define RCC_AHB1RSTR			MMIO32(RCC_BASE + 0x28)
/** RCC_AHB2RSTR AHB2 peripheral reset register **/
#define RCC_AHB2RSTR			MMIO32(RCC_BASE + 0x2c)
/** RCC_AHB3RSTR AHB3 peripheral reset register **/
#define RCC_AHB3RSTR			MMIO32(RCC_BASE + 0x30)
/** RCC_APB1RSTR1 APB1 peripheral reset register 1 **/
#define RCC_APB1RSTR1			MMIO32(RCC_BASE + 0x38)
/** RCC_APB1RSTR2 APB1 peripheral reset register 2 **/
#define RCC_APB1RSTR2			MMIO32(RCC_BASE + 0x3c)
/** RCC_APB2RSTR APB2 peripheral reset register **/
#define RCC_APB2RSTR			MMIO32(RCC_BASE + 0x40)
/** RCC_AHB1ENR AHB1 peripheral clock enable register **/
#define RCC_AHB1ENR			MMIO32(RCC_BASE + 0x48)
/** RCC_AHB2ENR AHB2 peripheral clock enable register **/
#define RCC_AHB2ENR			MMIO32(RCC_BASE + 0x4c)
/** RCC_AHB3ENR AHB3 peripheral clock enable register **/
#define RCC_AHB3ENR			MMIO32(RCC_BASE + 0x50)
/** RCC_APB1ENR1 APB1ENR1 **/
#define RCC_APB1ENR1			MMIO32(RCC_BASE + 0x58)
/** RCC_APB1ENR2 APB1 peripheral clock enable register 2 **/
#define RCC_APB1ENR2			MMIO32(RCC_BASE + 0x5c)
/** RCC_APB2ENR APB2ENR **/
#define RCC_APB2ENR			MMIO32(RCC_BASE + 0x60)
/** RCC_AHB1SMENR AHB1 peripheral clocks enable in Sleep and Stop modes register **/
#define RCC_AHB1SMENR			MMIO32(RCC_BASE + 0x68)
/** RCC_AHB2SMENR AHB2 peripheral clocks enable in Sleep and Stop modes register **/
#define RCC_AHB2SMENR			MMIO32(RCC_BASE + 0x6c)
/** RCC_AHB3SMENR AHB3 peripheral clocks enable in Sleep and Stop modes register **/
#define RCC_AHB3SMENR			MMIO32(RCC_BASE + 0x70)
/** RCC_APB1SMENR1 APB1SMENR1 **/
#define RCC_APB1SMENR1			MMIO32(RCC_BASE + 0x78)
/** RCC_APB1SMENR2 APB1 peripheral clocks enable in Sleep and Stop modes register 2 **/
#define RCC_APB1SMENR2			MMIO32(RCC_BASE + 0x7c)
/** RCC_APB2SMENR APB2SMENR **/
#define RCC_APB2SMENR			MMIO32(RCC_BASE + 0x80)
/** RCC_CCIPR1 CCIPR **/
#define RCC_CCIPR1			MMIO32(RCC_BASE + 0x88)
/** RCC_BDCR BDCR **/
#define RCC_BDCR			MMIO32(RCC_BASE + 0x90)
/** RCC_CSR CSR **/
#define RCC_CSR			MMIO32(RCC_BASE + 0x94)
/** RCC_CRRCR Clock recovery RC register **/
#define RCC_CRRCR			MMIO32(RCC_BASE + 0x98)
/** RCC_CCIPR2 Peripherals independent clock configuration register **/
#define RCC_CCIPR2			MMIO32(RCC_BASE + 0x9c)

/**@}*/


/** @defgroup rcc_cr CR Clock control register
@{*/

/** RCC_CR_PLLSYSRDY Main PLL clock ready flag **/
#define RCC_CR_PLLSYSRDY		(1 << 25)
/** RCC_CR_PLLSYSON Main PLL enable **/
#define RCC_CR_PLLSYSON		(1 << 24)
/** RCC_CR_HSECSSON Clock security system enable **/
#define RCC_CR_HSECSSON		(1 << 19)
/** RCC_CR_HSEBYP HSE crystal oscillator bypass **/
#define RCC_CR_HSEBYP		(1 << 18)
/** RCC_CR_HSERDY HSE clock ready flag **/
#define RCC_CR_HSERDY		(1 << 17)
/** RCC_CR_HSEON HSE clock enable **/
#define RCC_CR_HSEON		(1 << 16)
/** RCC_CR_HSIRDY HSI clock ready flag **/
#define RCC_CR_HSIRDY		(1 << 10)
/** RCC_CR_HSIKERON HSI always enable for peripheral kernels **/
#define RCC_CR_HSIKERON		(1 << 9)
/** RCC_CR_HSION HSI clock enable **/
#define RCC_CR_HSION		(1 << 8)

/**@}*/

/** @defgroup rcc_icscr ICSCR Internal clock sources calibration register
@{*/


#define RCC_ICSCR_HSITRIM_SHIFT		24
#define RCC_ICSCR_HSITRIM_MASK		0x7f
/** @defgroup rcc_icscr_hsitrim HSITRIM Internal High Speed clock trimming
@{*/
/**@}*/


#define RCC_ICSCR_HSICAL0_SHIFT		16
#define RCC_ICSCR_HSICAL0_MASK		0xff
/** @defgroup rcc_icscr_hsical0 HSICAL0 Internal High Speed clock Calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cfgr CFGR Clock configuration register
@{*/


#define RCC_CFGR_MCOPRE_SHIFT		28
#define RCC_CFGR_MCOPRE_MASK		0x07
/** @defgroup rcc_cfgr_mcopre MCOPRE Microcontroller clock output prescaler
@{*/
/**@}*/


#define RCC_CFGR_MCOSEL_SHIFT		24
#define RCC_CFGR_MCOSEL_MASK		0x0f
/** @defgroup rcc_cfgr_mcosel MCOSEL Microcontroller clock output
@{*/
/**@}*/


#define RCC_CFGR_PPRE2_SHIFT		11
#define RCC_CFGR_PPRE2_MASK		0x07
/** @defgroup rcc_cfgr_ppre2 PPRE2 APB high-speed prescaler (APB2)
@{*/
/**@}*/


#define RCC_CFGR_PPRE1_SHIFT		8
#define RCC_CFGR_PPRE1_MASK		0x07
/** @defgroup rcc_cfgr_ppre1 PPRE1 PB low-speed prescaler (APB1)
@{*/
/**@}*/


#define RCC_CFGR_HPRE_SHIFT		4
#define RCC_CFGR_HPRE_MASK		0x0f
/** @defgroup rcc_cfgr_hpre HPRE AHB prescaler
@{*/
/**@}*/


#define RCC_CFGR_SWS_SHIFT		2
#define RCC_CFGR_SWS_MASK		0x03
/** @defgroup rcc_cfgr_sws SWS System clock switch status
@{*/
/**@}*/


#define RCC_CFGR_SW_SHIFT		0
#define RCC_CFGR_SW_MASK		0x03
/** @defgroup rcc_cfgr_sw SW System clock switch
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_pllsyscfgr PLLSYSCFGR PLL configuration register
@{*/


#define RCC_PLLSYSCFGR_PLLSYSPDIV_SHIFT		27
#define RCC_PLLSYSCFGR_PLLSYSPDIV_MASK		0x1f
/** @defgroup rcc_pllsyscfgr_pllsyspdiv PLLSYSPDIV Main PLL division factor for PLLSAI2CLK
@{*/
/**@}*/


#define RCC_PLLSYSCFGR_PLLSYSR_SHIFT		25
#define RCC_PLLSYSCFGR_PLLSYSR_MASK		0x03
/** @defgroup rcc_pllsyscfgr_pllsysr PLLSYSR Main PLL division factor for PLLCLK (system clock)
@{*/
/**@}*/

/** RCC_PLLSYSCFGR_PLLSYSREN Main PLL PLLCLK output enable **/
#define RCC_PLLSYSCFGR_PLLSYSREN		(1 << 24)

#define RCC_PLLSYSCFGR_PLLSYSQ_SHIFT		21
#define RCC_PLLSYSCFGR_PLLSYSQ_MASK		0x03
/** @defgroup rcc_pllsyscfgr_pllsysq PLLSYSQ Main PLL division factor for PLLUSB1CLK(48 MHz clock)
@{*/
/**@}*/

/** RCC_PLLSYSCFGR_PLLSYSQEN Main PLL PLLUSB1CLK output enable **/
#define RCC_PLLSYSCFGR_PLLSYSQEN		(1 << 20)
/** RCC_PLLSYSCFGR_PLLSYSP Main PLL division factor for PLLSAI3CLK (SAI1 and SAI2 clock) **/
#define RCC_PLLSYSCFGR_PLLSYSP		(1 << 17)
/** RCC_PLLSYSCFGR_PLLPEN Main PLL PLLSAI3CLK output enable **/
#define RCC_PLLSYSCFGR_PLLPEN		(1 << 16)

#define RCC_PLLSYSCFGR_PLLSYSN_SHIFT		8
#define RCC_PLLSYSCFGR_PLLSYSN_MASK		0x7f
/** @defgroup rcc_pllsyscfgr_pllsysn PLLSYSN Main PLL multiplication factor for VCO
@{*/
/**@}*/


#define RCC_PLLSYSCFGR_PLLSYSM_SHIFT		4
#define RCC_PLLSYSCFGR_PLLSYSM_MASK		0x0f
/** @defgroup rcc_pllsyscfgr_pllsysm PLLSYSM Division factor for the main PLL and audio PLL (PLLSAI1 and PLLSAI2) input clock
@{*/
/**@}*/


#define RCC_PLLSYSCFGR_PLLSRC_SHIFT		0
#define RCC_PLLSYSCFGR_PLLSRC_MASK		0x03
/** @defgroup rcc_pllsyscfgr_pllsrc PLLSRC Main PLL, PLLSAI1 and PLLSAI2 entry clock source
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cier CIER Clock interrupt enable register
@{*/

