grevaillot/svd_tools/headers/STM32G471xx/rcc.h
/** RCC_CIER_RC48RDYIE HSI48 ready interrupt enable **/
#define RCC_CIER_RC48RDYIE		(1 << 10)
/** RCC_CIER_LSECSSIE LSE clock security system interrupt enable **/
#define RCC_CIER_LSECSSIE		(1 << 9)
/** RCC_CIER_PLLSYSRDYIE PLL ready interrupt enable **/
#define RCC_CIER_PLLSYSRDYIE		(1 << 5)
/** RCC_CIER_HSERDYIE HSE ready interrupt enable **/
#define RCC_CIER_HSERDYIE		(1 << 4)
/** RCC_CIER_HSIRDYIE HSI ready interrupt enable **/
#define RCC_CIER_HSIRDYIE		(1 << 3)
/** RCC_CIER_LSERDYIE LSE ready interrupt enable **/
#define RCC_CIER_LSERDYIE		(1 << 1)
/** RCC_CIER_LSIRDYIE LSI ready interrupt enable **/
#define RCC_CIER_LSIRDYIE		(1 << 0)

/**@}*/

/** @defgroup rcc_cifr CIFR Clock interrupt flag register
@{*/

/** RCC_CIFR_RC48RDYF HSI48 ready interrupt flag **/
#define RCC_CIFR_RC48RDYF		(1 << 10)
/** RCC_CIFR_LSECSSF LSE Clock security system interrupt flag **/
#define RCC_CIFR_LSECSSF		(1 << 9)
/** RCC_CIFR_HSECSSF Clock security system interrupt flag **/
#define RCC_CIFR_HSECSSF		(1 << 8)
/** RCC_CIFR_PLLSYSRDYF PLL ready interrupt flag **/
#define RCC_CIFR_PLLSYSRDYF		(1 << 5)
/** RCC_CIFR_HSERDYF HSE ready interrupt flag **/
#define RCC_CIFR_HSERDYF		(1 << 4)
/** RCC_CIFR_HSIRDYF HSI ready interrupt flag **/
#define RCC_CIFR_HSIRDYF		(1 << 3)
/** RCC_CIFR_LSERDYF LSE ready interrupt flag **/
#define RCC_CIFR_LSERDYF		(1 << 1)
/** RCC_CIFR_LSIRDYF LSI ready interrupt flag **/
#define RCC_CIFR_LSIRDYF		(1 << 0)

/**@}*/

/** @defgroup rcc_cicr CICR Clock interrupt clear register
@{*/

/** RCC_CICR_RC48RDYC HSI48 oscillator ready interrupt clear **/
#define RCC_CICR_RC48RDYC		(1 << 10)
/** RCC_CICR_LSECSSC LSE Clock security system interrupt clear **/
#define RCC_CICR_LSECSSC		(1 << 9)
/** RCC_CICR_HSECSSC Clock security system interrupt clear **/
#define RCC_CICR_HSECSSC		(1 << 8)
/** RCC_CICR_PLLSYSRDYC PLL ready interrupt clear **/
#define RCC_CICR_PLLSYSRDYC		(1 << 5)
/** RCC_CICR_HSERDYC HSE ready interrupt clear **/
#define RCC_CICR_HSERDYC		(1 << 4)
/** RCC_CICR_HSIRDYC HSI ready interrupt clear **/
#define RCC_CICR_HSIRDYC		(1 << 3)
/** RCC_CICR_LSERDYC LSE ready interrupt clear **/
#define RCC_CICR_LSERDYC		(1 << 1)
/** RCC_CICR_LSIRDYC LSI ready interrupt clear **/
#define RCC_CICR_LSIRDYC		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1rstr AHB1RSTR AHB1 peripheral reset register
@{*/

/** RCC_AHB1RSTR_CRCRST CRC reset **/
#define RCC_AHB1RSTR_CRCRST		(1 << 12)
/** RCC_AHB1RSTR_FLITFRST_ FLITF reset **/
#define RCC_AHB1RSTR_FLITFRST_		(1 << 8)
/** RCC_AHB1RSTR_MATRIXRST MATRIX reset **/
#define RCC_AHB1RSTR_MATRIXRST		(1 << 4)
/** RCC_AHB1RSTR_CORDICRST CORDIC reset **/
#define RCC_AHB1RSTR_CORDICRST		(1 << 3)
/** RCC_AHB1RSTR_DMAMUX1RST DMAMUXRST **/
#define RCC_AHB1RSTR_DMAMUX1RST		(1 << 2)
/** RCC_AHB1RSTR_DMA2RST DMA2 reset **/
#define RCC_AHB1RSTR_DMA2RST		(1 << 1)
/** RCC_AHB1RSTR_DMA1RST DMA1 reset **/
#define RCC_AHB1RSTR_DMA1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2rstr AHB2RSTR AHB2 peripheral reset register
@{*/

/** RCC_AHB2RSTR_RNGRST Random Number Generator module reset **/
#define RCC_AHB2RSTR_RNGRST		(1 << 26)
/** RCC_AHB2RSTR_CRYPTRST Cryptography module reset **/
#define RCC_AHB2RSTR_CRYPTRST		(1 << 24)
/** RCC_AHB2RSTR_DAC4RST DAC4 interface reset **/
#define RCC_AHB2RSTR_DAC4RST		(1 << 19)
/** RCC_AHB2RSTR_DAC3RST DAC3 interface reset **/
#define RCC_AHB2RSTR_DAC3RST		(1 << 18)
/** RCC_AHB2RSTR_DAC2RST DAC2 interface reset **/
#define RCC_AHB2RSTR_DAC2RST		(1 << 17)
/** RCC_AHB2RSTR_DAC1RST_ DAC1 interface reset **/
#define RCC_AHB2RSTR_DAC1RST_		(1 << 16)
/** RCC_AHB2RSTR_ADC345RST_ SAR ADC345 interface reset **/
#define RCC_AHB2RSTR_ADC345RST_		(1 << 14)
/** RCC_AHB2RSTR_ADC12RST ADC reset **/
#define RCC_AHB2RSTR_ADC12RST		(1 << 13)
/** RCC_AHB2RSTR_GPIOGRST IO port G reset **/
#define RCC_AHB2RSTR_GPIOGRST		(1 << 6)
/** RCC_AHB2RSTR_GPIOFRST IO port F reset **/
#define RCC_AHB2RSTR_GPIOFRST		(1 << 5)
/** RCC_AHB2RSTR_GPIOERST IO port E reset **/
#define RCC_AHB2RSTR_GPIOERST		(1 << 4)
/** RCC_AHB2RSTR_GPIODRST IO port D reset **/
#define RCC_AHB2RSTR_GPIODRST		(1 << 3)
/** RCC_AHB2RSTR_GPIOCRST IO port C reset **/
#define RCC_AHB2RSTR_GPIOCRST		(1 << 2)
/** RCC_AHB2RSTR_GPIOBRST IO port B reset **/
#define RCC_AHB2RSTR_GPIOBRST		(1 << 1)
/** RCC_AHB2RSTR_GPIOARST IO port A reset **/
#define RCC_AHB2RSTR_GPIOARST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3rstr AHB3RSTR AHB3 peripheral reset register
@{*/

/** RCC_AHB3RSTR_QUADSPI1RST Quad SPI 1 module reset **/
#define RCC_AHB3RSTR_QUADSPI1RST		(1 << 8)
/** RCC_AHB3RSTR_FMCRST Flexible memory controller reset **/
#define RCC_AHB3RSTR_FMCRST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1rstr1 APB1RSTR1 APB1 peripheral reset register 1
@{*/

/** RCC_APB1RSTR1_LPTIM1RST Low Power Timer 1 reset **/
#define RCC_APB1RSTR1_LPTIM1RST		(1 << 31)
/** RCC_APB1RSTR1_I2C3 I2C3 interface reset **/
#define RCC_APB1RSTR1_I2C3		(1 << 30)
/** RCC_APB1RSTR1_PWRRST Power interface reset **/
#define RCC_APB1RSTR1_PWRRST		(1 << 28)
/** RCC_APB1RSTR1_FDCANRST FDCAN reset **/
#define RCC_APB1RSTR1_FDCANRST		(1 << 25)
/** RCC_APB1RSTR1_USBDRST USBD reset **/
#define RCC_APB1RSTR1_USBDRST		(1 << 23)
/** RCC_APB1RSTR1_I2C2RST I2C2 reset **/
#define RCC_APB1RSTR1_I2C2RST		(1 << 22)
/** RCC_APB1RSTR1_I2C1RST I2C1 reset **/
#define RCC_APB1RSTR1_I2C1RST		(1 << 21)
/** RCC_APB1RSTR1_UART5RST UART5 reset **/
#define RCC_APB1RSTR1_UART5RST		(1 << 20)
/** RCC_APB1RSTR1_UART4RST UART4 reset **/
#define RCC_APB1RSTR1_UART4RST		(1 << 19)
/** RCC_APB1RSTR1_USART3RST USART3 reset **/
#define RCC_APB1RSTR1_USART3RST		(1 << 18)
/** RCC_APB1RSTR1_USART2RST USART2 reset **/
#define RCC_APB1RSTR1_USART2RST		(1 << 17)
/** RCC_APB1RSTR1_SPI3RST SPI3 reset **/
#define RCC_APB1RSTR1_SPI3RST		(1 << 15)
/** RCC_APB1RSTR1_SPI2RST SPI2 reset **/
#define RCC_APB1RSTR1_SPI2RST		(1 << 14)
/** RCC_APB1RSTR1_CRSRST Clock recovery system reset **/
#define RCC_APB1RSTR1_CRSRST		(1 << 8)
/** RCC_APB1RSTR1_TIM7RST TIM7 timer reset **/
#define RCC_APB1RSTR1_TIM7RST		(1 << 5)
/** RCC_APB1RSTR1_TIM6RST TIM6 timer reset **/
#define RCC_APB1RSTR1_TIM6RST		(1 << 4)
/** RCC_APB1RSTR1_TIM5RST TIM5 timer reset **/
#define RCC_APB1RSTR1_TIM5RST		(1 << 3)
/** RCC_APB1RSTR1_TIM4RST TIM3 timer reset **/
#define RCC_APB1RSTR1_TIM4RST		(1 << 2)
/** RCC_APB1RSTR1_TIM3RST TIM3 timer reset **/
#define RCC_APB1RSTR1_TIM3RST		(1 << 1)
/** RCC_APB1RSTR1_TIM2RST TIM2 timer reset **/
#define RCC_APB1RSTR1_TIM2RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1rstr2 APB1RSTR2 APB1 peripheral reset register 2
@{*/

/** RCC_APB1RSTR2_USBPDRST USBPD reset **/
#define RCC_APB1RSTR2_USBPDRST		(1 << 8)
/** RCC_APB1RSTR2_I2C4RST I2C4 reset **/
#define RCC_APB1RSTR2_I2C4RST		(1 << 1)
/** RCC_APB1RSTR2_LPUART1RST Low-power UART 1 reset **/
#define RCC_APB1RSTR2_LPUART1RST		(1 << 0)

/**@}*/

