grevaillot/svd_tools/headers/STM32G471xx/rcc.h
/** @defgroup rcc_apb2rstr APB2RSTR APB2 peripheral reset register
@{*/

/** RCC_APB2RSTR_HRTIM1RST HRTIMER reset **/
#define RCC_APB2RSTR_HRTIM1RST		(1 << 26)
/** RCC_APB2RSTR_SAI1RST Serial audio interface 1 (SAI1) reset **/
#define RCC_APB2RSTR_SAI1RST		(1 << 21)
/** RCC_APB2RSTR_TIM20RST Timer 20 reset **/
#define RCC_APB2RSTR_TIM20RST		(1 << 20)
/** RCC_APB2RSTR_TIM17RST TIM17 timer reset **/
#define RCC_APB2RSTR_TIM17RST		(1 << 18)
/** RCC_APB2RSTR_TIM16RST TIM16 timer reset **/
#define RCC_APB2RSTR_TIM16RST		(1 << 17)
/** RCC_APB2RSTR_TIM15RST TIM15 timer reset **/
#define RCC_APB2RSTR_TIM15RST		(1 << 16)
/** RCC_APB2RSTR_SPI4RST SPI 4 reset **/
#define RCC_APB2RSTR_SPI4RST		(1 << 15)
/** RCC_APB2RSTR_USART1RST USART1 reset **/
#define RCC_APB2RSTR_USART1RST		(1 << 14)
/** RCC_APB2RSTR_TIM8RST TIM8 timer reset **/
#define RCC_APB2RSTR_TIM8RST		(1 << 13)
/** RCC_APB2RSTR_SPI1RST SPI1 reset **/
#define RCC_APB2RSTR_SPI1RST		(1 << 12)
/** RCC_APB2RSTR_TIM1RST TIM1 timer reset **/
#define RCC_APB2RSTR_TIM1RST		(1 << 11)
/** RCC_APB2RSTR_SYSCFGRST System configuration (SYSCFG) reset **/
#define RCC_APB2RSTR_SYSCFGRST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1enr AHB1ENR AHB1 peripheral clock enable register
@{*/

/** RCC_AHB1ENR_CRCEN CRC clock enable **/
#define RCC_AHB1ENR_CRCEN		(1 << 12)
/** RCC_AHB1ENR_FLITFEN FLITF clock enable **/
#define RCC_AHB1ENR_FLITFEN		(1 << 8)
/** RCC_AHB1ENR_FMACEN FMAC clock enable **/
#define RCC_AHB1ENR_FMACEN		(1 << 4)
/** RCC_AHB1ENR_CORDICEN CORDIC clock enable **/
#define RCC_AHB1ENR_CORDICEN		(1 << 3)
/** RCC_AHB1ENR_DMAMUXEN DMAMUX clock enable **/
#define RCC_AHB1ENR_DMAMUXEN		(1 << 2)
/** RCC_AHB1ENR_DMA2EN DMA2 clock enable **/
#define RCC_AHB1ENR_DMA2EN		(1 << 1)
/** RCC_AHB1ENR_DMA1EN DMA1 clock enable **/
#define RCC_AHB1ENR_DMA1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2enr AHB2ENR AHB2 peripheral clock enable register
@{*/

/** RCC_AHB2ENR_RNGEN Random Number Generator clock enable **/
#define RCC_AHB2ENR_RNGEN		(1 << 26)
/** RCC_AHB2ENR_CRYPTEN Cryptography clock enable **/
#define RCC_AHB2ENR_CRYPTEN		(1 << 24)
/** RCC_AHB2ENR_DAC4 DAC4 clock enable **/
#define RCC_AHB2ENR_DAC4		(1 << 19)
/** RCC_AHB2ENR_DAC3 Random Number Generator clock enable **/
#define RCC_AHB2ENR_DAC3		(1 << 18)
/** RCC_AHB2ENR_DAC2 HASH clock enable **/
#define RCC_AHB2ENR_DAC2		(1 << 17)
/** RCC_AHB2ENR_DAC1 AES accelerator clock enable **/
#define RCC_AHB2ENR_DAC1		(1 << 16)
/** RCC_AHB2ENR_ADC345EN DCMI clock enable **/
#define RCC_AHB2ENR_ADC345EN		(1 << 14)
/** RCC_AHB2ENR_ADC12EN ADC clock enable **/
#define RCC_AHB2ENR_ADC12EN		(1 << 13)
/** RCC_AHB2ENR_GPIOGEN IO port G clock enable **/
#define RCC_AHB2ENR_GPIOGEN		(1 << 6)
/** RCC_AHB2ENR_GPIOFEN IO port F clock enable **/
#define RCC_AHB2ENR_GPIOFEN		(1 << 5)
/** RCC_AHB2ENR_GPIOEEN IO port E clock enable **/
#define RCC_AHB2ENR_GPIOEEN		(1 << 4)
/** RCC_AHB2ENR_GPIODEN IO port D clock enable **/
#define RCC_AHB2ENR_GPIODEN		(1 << 3)
/** RCC_AHB2ENR_GPIOCEN IO port C clock enable **/
#define RCC_AHB2ENR_GPIOCEN		(1 << 2)
/** RCC_AHB2ENR_GPIOBEN IO port B clock enable **/
#define RCC_AHB2ENR_GPIOBEN		(1 << 1)
/** RCC_AHB2ENR_GPIOAEN IO port A clock enable **/
#define RCC_AHB2ENR_GPIOAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3enr AHB3ENR AHB3 peripheral clock enable register
@{*/

/** RCC_AHB3ENR_QUADSPI1EN Quad SPI 1 module clock enable **/
#define RCC_AHB3ENR_QUADSPI1EN		(1 << 8)
/** RCC_AHB3ENR_FMCEN Flexible memory controller clock enable **/
#define RCC_AHB3ENR_FMCEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr1 APB1ENR1 APB1ENR1
@{*/

/** RCC_APB1ENR1_LPTIM1EN Low power timer 1 clock enable **/
#define RCC_APB1ENR1_LPTIM1EN		(1 << 31)
/** RCC_APB1ENR1_I2C3 OPAMP interface clock enable **/
#define RCC_APB1ENR1_I2C3		(1 << 30)
/** RCC_APB1ENR1_PWREN Power interface clock enable **/
#define RCC_APB1ENR1_PWREN		(1 << 28)
/** RCC_APB1ENR1_FDCANEN FDCAN clock enable **/
#define RCC_APB1ENR1_FDCANEN		(1 << 25)
/** RCC_APB1ENR1_USBDEN USBDclock enable **/
#define RCC_APB1ENR1_USBDEN		(1 << 23)
/** RCC_APB1ENR1_I2C2EN I2C2 clock enable **/
#define RCC_APB1ENR1_I2C2EN		(1 << 22)
/** RCC_APB1ENR1_I2C1EN I2C1 clock enable **/
#define RCC_APB1ENR1_I2C1EN		(1 << 21)
/** RCC_APB1ENR1_UART5EN UART5 clock enable **/
#define RCC_APB1ENR1_UART5EN		(1 << 20)
/** RCC_APB1ENR1_UART4EN UART4 clock enable **/
#define RCC_APB1ENR1_UART4EN		(1 << 19)
/** RCC_APB1ENR1_USART3EN USART3 clock enable **/
#define RCC_APB1ENR1_USART3EN		(1 << 18)
/** RCC_APB1ENR1_USART2EN USART2 clock enable **/
#define RCC_APB1ENR1_USART2EN		(1 << 17)
/** RCC_APB1ENR1_SP3EN SPI3 clock enable **/
#define RCC_APB1ENR1_SP3EN		(1 << 15)
/** RCC_APB1ENR1_SPI2EN SPI2 clock enable **/
#define RCC_APB1ENR1_SPI2EN		(1 << 14)
/** RCC_APB1ENR1_WWDGEN Window watchdog clock enable **/
#define RCC_APB1ENR1_WWDGEN		(1 << 11)
/** RCC_APB1ENR1_RTCAPBEN RTC APB clock enable **/
#define RCC_APB1ENR1_RTCAPBEN		(1 << 10)
/** RCC_APB1ENR1_CRSEN CRSclock enable **/
#define RCC_APB1ENR1_CRSEN		(1 << 8)
/** RCC_APB1ENR1_TIM7EN TIM7 timer clock enable **/
#define RCC_APB1ENR1_TIM7EN		(1 << 5)
/** RCC_APB1ENR1_TIM6EN TIM6 timer clock enable **/
#define RCC_APB1ENR1_TIM6EN		(1 << 4)
/** RCC_APB1ENR1_TIM5EN TIM5 timer clock enable **/
#define RCC_APB1ENR1_TIM5EN		(1 << 3)
/** RCC_APB1ENR1_TIM4EN TIM4 timer clock enable **/
#define RCC_APB1ENR1_TIM4EN		(1 << 2)
/** RCC_APB1ENR1_TIM3EN TIM3 timer clock enable **/
#define RCC_APB1ENR1_TIM3EN		(1 << 1)
/** RCC_APB1ENR1_TIM2EN TIM2 timer clock enable **/
#define RCC_APB1ENR1_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr2 APB1ENR2 APB1 peripheral clock enable register 2
@{*/

/** RCC_APB1ENR2_USBPDEN USBPD clock enable **/
#define RCC_APB1ENR2_USBPDEN		(1 << 8)
/** RCC_APB1ENR2_I2C4EN I2C4 clock enable **/
#define RCC_APB1ENR2_I2C4EN		(1 << 1)
/** RCC_APB1ENR2_LPUART1EN Low power UART 1 clock enable **/
#define RCC_APB1ENR2_LPUART1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2enr APB2ENR APB2ENR
@{*/

/** RCC_APB2ENR_HRTIMEREN HRTIMER clock enable **/
#define RCC_APB2ENR_HRTIMEREN		(1 << 26)
/** RCC_APB2ENR_SAI1EN SAI1 clock enable **/
#define RCC_APB2ENR_SAI1EN		(1 << 21)
/** RCC_APB2ENR_TIM20EN Timer 20 clock enable **/
#define RCC_APB2ENR_TIM20EN		(1 << 20)
/** RCC_APB2ENR_TIM17EN TIM17 timer clock enable **/
#define RCC_APB2ENR_TIM17EN		(1 << 18)
/** RCC_APB2ENR_TIM16EN TIM16 timer clock enable **/
#define RCC_APB2ENR_TIM16EN		(1 << 17)
/** RCC_APB2ENR_TIM15EN TIM15 timer clock enable **/
#define RCC_APB2ENR_TIM15EN		(1 << 16)
/** RCC_APB2ENR_SPI4EN SPI 4 clock enable **/
#define RCC_APB2ENR_SPI4EN		(1 << 15)
/** RCC_APB2ENR_USART1EN USART1clock enable **/
#define RCC_APB2ENR_USART1EN		(1 << 14)
/** RCC_APB2ENR_TIM8EN TIM8 timer clock enable **/
#define RCC_APB2ENR_TIM8EN		(1 << 13)
/** RCC_APB2ENR_SPI1EN SPI1 clock enable **/
#define RCC_APB2ENR_SPI1EN		(1 << 12)
/** RCC_APB2ENR_TIM1EN TIM1 timer clock enable **/
#define RCC_APB2ENR_TIM1EN		(1 << 11)
/** RCC_APB2ENR_SYSCFGEN SYSCFG clock enable **/
#define RCC_APB2ENR_SYSCFGEN		(1 << 0)

/**@}*/

