grevaillot/svd_tools/headers/STM32G471xx/rcc.h
/** @defgroup rcc_ahb1smenr AHB1SMENR AHB1 peripheral clocks enable in Sleep and Stop modes register
@{*/

/** RCC_AHB1SMENR_CRCSMEN CRCSMEN **/
#define RCC_AHB1SMENR_CRCSMEN		(1 << 12)
/** RCC_AHB1SMENR_SRAM1SMEN SRAM1 interface clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_SRAM1SMEN		(1 << 9)
/** RCC_AHB1SMENR_FLASHSMEN Flash memory interface clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_FLASHSMEN		(1 << 8)
/** RCC_AHB1SMENR_FMACSMEN FMACSM clock enable **/
#define RCC_AHB1SMENR_FMACSMEN		(1 << 4)
/** RCC_AHB1SMENR_CORDICSMEN CORDIC clock enable during sleep mode **/
#define RCC_AHB1SMENR_CORDICSMEN		(1 << 3)
/** RCC_AHB1SMENR_DMAMUX1SMEN DMAMUX clock enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_DMAMUX1SMEN		(1 << 2)
/** RCC_AHB1SMENR_DMA2SMEN DMA2 clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_DMA2SMEN		(1 << 1)
/** RCC_AHB1SMENR_DMA1SMEN DMA1 clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_DMA1SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2smenr AHB2SMENR AHB2 peripheral clocks enable in Sleep and Stop modes register
@{*/

/** RCC_AHB2SMENR_RNGSMEN Random Number Generator clock enable during sleep mode **/
#define RCC_AHB2SMENR_RNGSMEN		(1 << 26)
/** RCC_AHB2SMENR_CRYPTSMEN Cryptography clock enable during sleep mode **/
#define RCC_AHB2SMENR_CRYPTSMEN		(1 << 24)
/** RCC_AHB2SMENR_DAC4SMEN DAC4 clock enable during sleep mode **/
#define RCC_AHB2SMENR_DAC4SMEN		(1 << 19)
/** RCC_AHB2SMENR_DAC3SMEN DAC3 clock enable during sleep mode **/
#define RCC_AHB2SMENR_DAC3SMEN		(1 << 18)
/** RCC_AHB2SMENR_DAC2SMEN HASH clock enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_DAC2SMEN		(1 << 17)
/** RCC_AHB2SMENR_DAC1SMEN AES accelerator clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_DAC1SMEN		(1 << 16)
/** RCC_AHB2SMENR_ADC345SMEN DCMI clock enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_ADC345SMEN		(1 << 14)
/** RCC_AHB2SMENR_AD12CSMEN ADC clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_AD12CSMEN		(1 << 13)
/** RCC_AHB2SMENR_SRAM3SMEN SRAM2 interface clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_SRAM3SMEN		(1 << 10)
/** RCC_AHB2SMENR_SRAM2SMEN SRAM2 interface clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_SRAM2SMEN		(1 << 9)
/** RCC_AHB2SMENR_GPIOGSMEN IO port G clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOGSMEN		(1 << 6)
/** RCC_AHB2SMENR_GPIOFSMEN IO port F clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOFSMEN		(1 << 5)
/** RCC_AHB2SMENR_GPIOESMEN IO port E clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOESMEN		(1 << 4)
/** RCC_AHB2SMENR_GPIODSMEN IO port D clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIODSMEN		(1 << 3)
/** RCC_AHB2SMENR_GPIOCSMEN IO port C clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOCSMEN		(1 << 2)
/** RCC_AHB2SMENR_GPIOBSMEN IO port B clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOBSMEN		(1 << 1)
/** RCC_AHB2SMENR_GPIOASMEN IO port A clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOASMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3smenr AHB3SMENR AHB3 peripheral clocks enable in Sleep and Stop modes register
@{*/

/** RCC_AHB3SMENR_QUADSPI1SMEN QUAD SPI 1 module clock enable during sleep mode **/
#define RCC_AHB3SMENR_QUADSPI1SMEN		(1 << 8)
/** RCC_AHB3SMENR_FMCSMEN Flexible memory controller clocks enable during Sleep and Stop modes **/
#define RCC_AHB3SMENR_FMCSMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1smenr1 APB1SMENR1 APB1SMENR1
@{*/

/** RCC_APB1SMENR1_LPTIM1SMEN Low Power Timer1 clock enable during sleep mode **/
#define RCC_APB1SMENR1_LPTIM1SMEN		(1 << 31)
/** RCC_APB1SMENR1_I2C3SMEN_3 I2C 3 interface clock enable during sleep mode **/
#define RCC_APB1SMENR1_I2C3SMEN_3		(1 << 30)
/** RCC_APB1SMENR1_PWRSMEN Power interface clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_PWRSMEN		(1 << 28)
/** RCC_APB1SMENR1_FDCANSMEN FDCAN clock enable during sleep mode **/
#define RCC_APB1SMENR1_FDCANSMEN		(1 << 25)
/** RCC_APB1SMENR1_I2C3SMEN I2C3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C3SMEN		(1 << 23)
/** RCC_APB1SMENR1_I2C2SMEN I2C2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C2SMEN		(1 << 22)
/** RCC_APB1SMENR1_I2C1SMEN I2C1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C1SMEN		(1 << 21)
/** RCC_APB1SMENR1_UART5SMEN UART5 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_UART5SMEN		(1 << 20)
/** RCC_APB1SMENR1_UART4SMEN UART4 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_UART4SMEN		(1 << 19)
/** RCC_APB1SMENR1_USART3SMEN USART3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_USART3SMEN		(1 << 18)
/** RCC_APB1SMENR1_USART2SMEN USART2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_USART2SMEN		(1 << 17)
/** RCC_APB1SMENR1_SP3SMEN SPI3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_SP3SMEN		(1 << 15)
/** RCC_APB1SMENR1_SPI2SMEN SPI2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_SPI2SMEN		(1 << 14)
/** RCC_APB1SMENR1_WWDGSMEN Window watchdog clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_WWDGSMEN		(1 << 11)
/** RCC_APB1SMENR1_RTCAPBSMEN RTC APB clock enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_RTCAPBSMEN		(1 << 10)
/** RCC_APB1SMENR1_CRSSMEN CRS clock enable during sleep mode **/
#define RCC_APB1SMENR1_CRSSMEN		(1 << 8)
/** RCC_APB1SMENR1_TIM7SMEN TIM7 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM7SMEN		(1 << 5)
/** RCC_APB1SMENR1_TIM6SMEN TIM6 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM6SMEN		(1 << 4)
/** RCC_APB1SMENR1_TIM5SMEN TIM5 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM5SMEN		(1 << 3)
/** RCC_APB1SMENR1_TIM4SMEN TIM4 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM4SMEN		(1 << 2)
/** RCC_APB1SMENR1_TIM3SMEN TIM3 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM3SMEN		(1 << 1)
/** RCC_APB1SMENR1_TIM2SMEN TIM2 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM2SMEN		(1 << 0)

/**@}*/

