grevaillot/svd_tools/headers/STM32G471xx/rcc.h
/** @defgroup rcc_apb1smenr2 APB1SMENR2 APB1 peripheral clocks enable in Sleep and Stop modes register 2
@{*/

/** RCC_APB1SMENR2_USBPDSMEN USB PD clock enable during sleep mode **/
#define RCC_APB1SMENR2_USBPDSMEN		(1 << 8)
/** RCC_APB1SMENR2_I2C4SMEN I2C4 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_I2C4SMEN		(1 << 1)
/** RCC_APB1SMENR2_LPUART1SMEN Low power UART 1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_LPUART1SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2smenr APB2SMENR APB2SMENR
@{*/

/** RCC_APB2SMENR_HRTIMERSMEN HRTIMER clock enable during sleep mode **/
#define RCC_APB2SMENR_HRTIMERSMEN		(1 << 26)
/** RCC_APB2SMENR_SAI1SMEN SAI1 clock enable during sleep mode **/
#define RCC_APB2SMENR_SAI1SMEN		(1 << 21)
/** RCC_APB2SMENR_TIM20SMEN Timer 20clock enable during sleep mode **/
#define RCC_APB2SMENR_TIM20SMEN		(1 << 20)
/** RCC_APB2SMENR_TIM17SMEN TIM17 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM17SMEN		(1 << 18)
/** RCC_APB2SMENR_TIM16SMEN TIM16 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM16SMEN		(1 << 17)
/** RCC_APB2SMENR_TIM15SMEN TIM15 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM15SMEN		(1 << 16)
/** RCC_APB2SMENR_SPI4SMEN SPI4 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SPI4SMEN		(1 << 15)
/** RCC_APB2SMENR_USART1SMEN USART1clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_USART1SMEN		(1 << 14)
/** RCC_APB2SMENR_TIM8SMEN TIM8 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM8SMEN		(1 << 13)
/** RCC_APB2SMENR_SPI1SMEN SPI1 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SPI1SMEN		(1 << 12)
/** RCC_APB2SMENR_TIM1SMEN TIM1 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM1SMEN		(1 << 11)
/** RCC_APB2SMENR_SYSCFGSMEN SYSCFG clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SYSCFGSMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ccipr1 CCIPR1 CCIPR
@{*/


#define RCC_CCIPR1_ADC345SEL_SHIFT		30
#define RCC_CCIPR1_ADC345SEL_MASK		0x03
/** @defgroup rcc_ccipr1_adc345sel ADC345SEL ADC3/4/5 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_ADCSEL_SHIFT		28
#define RCC_CCIPR1_ADCSEL_MASK		0x03
/** @defgroup rcc_ccipr1_adcsel ADCSEL ADCs clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_CLK48SEL_SHIFT		26
#define RCC_CCIPR1_CLK48SEL_MASK		0x03
/** @defgroup rcc_ccipr1_clk48sel CLK48SEL 48 MHz clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_FDCANSEL_SHIFT		24
#define RCC_CCIPR1_FDCANSEL_MASK		0x03
/** @defgroup rcc_ccipr1_fdcansel FDCANSEL SAI2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_SPISEL__SHIFT		22
#define RCC_CCIPR1_SPISEL__MASK		0x03
/** @defgroup rcc_ccipr1_spisel_ SPISEL SAI1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_SAISEL_SHIFT		20
#define RCC_CCIPR1_SAISEL_MASK		0x03
/** @defgroup rcc_ccipr1_saisel SAISEL Low power timer 2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_LPTIM1SEL_SHIFT		18
#define RCC_CCIPR1_LPTIM1SEL_MASK		0x03
/** @defgroup rcc_ccipr1_lptim1sel LPTIM1SEL Low power timer 1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_I2C3SEL_SHIFT		16
#define RCC_CCIPR1_I2C3SEL_MASK		0x03
/** @defgroup rcc_ccipr1_i2c3sel I2C3SEL I2C3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_I2C2SEL_SHIFT		14
#define RCC_CCIPR1_I2C2SEL_MASK		0x03
/** @defgroup rcc_ccipr1_i2c2sel I2C2SEL I2C2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_I2C1SEL_SHIFT		12
#define RCC_CCIPR1_I2C1SEL_MASK		0x03
/** @defgroup rcc_ccipr1_i2c1sel I2C1SEL I2C1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_LPUART1SEL_SHIFT		10
#define RCC_CCIPR1_LPUART1SEL_MASK		0x03
/** @defgroup rcc_ccipr1_lpuart1sel LPUART1SEL LPUART1 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_UART5SEL_SHIFT		8
#define RCC_CCIPR1_UART5SEL_MASK		0x03
/** @defgroup rcc_ccipr1_uart5sel UART5SEL UART5 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_UART4SEL_SHIFT		6
#define RCC_CCIPR1_UART4SEL_MASK		0x03
/** @defgroup rcc_ccipr1_uart4sel UART4SEL UART4 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_USART3SEL_SHIFT		4
#define RCC_CCIPR1_USART3SEL_MASK		0x03
/** @defgroup rcc_ccipr1_usart3sel USART3SEL USART3 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_USART2SEL_SHIFT		2
#define RCC_CCIPR1_USART2SEL_MASK		0x03
/** @defgroup rcc_ccipr1_usart2sel USART2SEL USART2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR1_USART1SEL_SHIFT		0
#define RCC_CCIPR1_USART1SEL_MASK		0x03
/** @defgroup rcc_ccipr1_usart1sel USART1SEL USART1 clock source selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_bdcr BDCR BDCR
@{*/

/** RCC_BDCR_LSCOSEL Low speed clock output selection **/
#define RCC_BDCR_LSCOSEL		(1 << 25)
/** RCC_BDCR_LSCCOEN Low speed clock output enable **/
#define RCC_BDCR_LSCCOEN		(1 << 24)
/** RCC_BDCR_VSWRST Vswitch domain software reset **/
#define RCC_BDCR_VSWRST		(1 << 16)
/** RCC_BDCR_RTCEN RTC clock enable **/
#define RCC_BDCR_RTCEN		(1 << 15)

#define RCC_BDCR_RTCSEL_SHIFT		8
#define RCC_BDCR_RTCSEL_MASK		0x03
/** @defgroup rcc_bdcr_rtcsel RTCSEL RTC clock source selection
@{*/
/**@}*/

/** RCC_BDCR_LSECSSD LSECSSD **/
#define RCC_BDCR_LSECSSD		(1 << 6)
/** RCC_BDCR_LSECSSON LSECSSON **/
#define RCC_BDCR_LSECSSON		(1 << 5)

#define RCC_BDCR_LSEDRV_SHIFT		3
#define RCC_BDCR_LSEDRV_MASK		0x03
/** @defgroup rcc_bdcr_lsedrv LSEDRV SE oscillator drive capability
@{*/
/**@}*/

/** RCC_BDCR_LSEBYP LSE oscillator bypass **/
#define RCC_BDCR_LSEBYP		(1 << 2)
/** RCC_BDCR_LSERDY LSE oscillator ready **/
#define RCC_BDCR_LSERDY		(1 << 1)
/** RCC_BDCR_LSEON LSE oscillator enable **/
#define RCC_BDCR_LSEON		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR CSR
@{*/

/** RCC_CSR_LPWRSTF Low-power reset flag **/
#define RCC_CSR_LPWRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_WDGRSTF Independent window watchdog reset flag **/
#define RCC_CSR_WDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_BORRSTF BOR flag **/
#define RCC_CSR_BORRSTF		(1 << 27)
/** RCC_CSR_PADRSTF Pad reset flag **/
#define RCC_CSR_PADRSTF		(1 << 26)
/** RCC_CSR_OBLRSTF Option byte loader reset flag **/
#define RCC_CSR_OBLRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 23)
/** RCC_CSR_LSIRDY LSI oscillator ready **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION LSI oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/

/** @defgroup rcc_crrcr CRRCR Clock recovery RC register
@{*/


#define RCC_CRRCR_RC48CAL_SHIFT		7
#define RCC_CRRCR_RC48CAL_MASK		0x1ff
/** @defgroup rcc_crrcr_rc48cal RC48CAL HSI48 clock calibration
@{*/
/**@}*/

/** RCC_CRRCR_RC48RDY HSI48 clock ready flag **/
#define RCC_CRRCR_RC48RDY		(1 << 1)
/** RCC_CRRCR_RC48ON HSI48 clock enable **/
#define RCC_CRRCR_RC48ON		(1 << 0)

/**@}*/

/** @defgroup rcc_ccipr2 CCIPR2 Peripherals independent clock configuration register
@{*/


#define RCC_CCIPR2_QUADSPISEL_SHIFT		20
#define RCC_CCIPR2_QUADSPISEL_MASK		0x03
/** @defgroup rcc_ccipr2_quadspisel QUADSPISEL Octospi clock source selection
@{*/
/**@}*/


#define RCC_CCIPR2_I2C4SEL_SHIFT		0
#define RCC_CCIPR2_I2C4SEL_MASK		0x03
/** @defgroup rcc_ccipr2_i2c4sel I2C4SEL I2C4 clock source selection
@{*/
/**@}*/


/**@}*/
